Revit 2026 API

# LogicalOrFilter(IListElementFilter) Constructor

---

Initializes a new instance of the LogicalOrFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public LogicalOrFilter(
	IList<ElementFilter> filters
)
```
```vb
Public Sub New (
	filters As IList(Of ElementFilter)
)
```
```cpp
public:
LogicalOrFilter(
	IList<ElementFilter^>^ filters
)
```
```fsharp
new :
        filters : IList<ElementFilter> -> LogicalOrFilter
```

#### Parameters

filters IListElementFilter

#### Reference

LogicalOrFilter Class

LogicalOrFilter Overload

Autodesk.Revit.DB Namespace